Mempelajari mengenai cara mengkonfersi data string ke numerik

In [2]:
import pandas as pd
print(pd.__version__)

2.2.3

In [3]:
data = {"kolom1":['1','2','3','teks'],
        "kolom2":['1','2','3','4']}

mn = pd.DataFrame(data)

mn

  kolom1 kolom2
0      1      1
1      2      2
2      3      3
3   teks      4

In [4]:
mn.dtypes

kolom1    object
kolom2    object
dtype: object

Selanjutnya kita akan mencoba menkonfersi salah satu kolom tersebut menjadi data integer agar mudah dimanipulasi

kita akan gunakan [astype()]
kita dapat mengkonfersinya ke 'int' atau  'float'

In [10]:
mn_ubah=mn.astype({'kolom2':"float"})

mn_ubah

  kolom1  kolom2
0      1     1.0
1      2     2.0
2      3     3.0
3   teks     4.0

In [15]:
mn_ubah.dtypes

kolom1     object
kolom2    float64
dtype: object

Selanjutnya saat kita ingin mengkonfersi data ke numerik ke seluruh data dalam dataframe

caranya adalah dengan menggunakan fungsi [to_numeric()]

In [16]:
mn.apply(pd.to_numeric, errors='coerce')

   kolom1  kolom2
0     1.0       1
1     2.0       2
2     3.0       3
3     NaN       4